Revit 2026 API

# SolidUtilsClone Method

---

Creates a new Solid which is a copy of the input Solid.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Solid Clone(
	Solid solid
)
```
```vb
Public Shared Function Clone (
	solid As Solid
) As Solid
```
```cpp
public:
static Solid^ Clone(
	Solid^ solid
)
```
```fsharp
static member Clone :
        solid : Solid -> Solid
```

#### Parameters

solid Solid
     The input solid to be copied.

#### Return Value

Solid The newly created Solid.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

SolidUtils Class

Autodesk.Revit.DB Namespace